Repository: xcv58/MacTools
Catalog: Plugins/ClipboardHistory/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# backup.error.changed
source: 本机剪贴板数据已更改。请重新预览备份。
ar: تغيرت بيانات الحافظة المحلية. عاين النسخة الاحتياطية مجددًا.
de: Die lokalen Zwischenablagedaten wurden geändert. Zeige die Vorschau erneut an.
en: Local clipboard data changed. Preview the backup again.
es: Los datos locales del portapapeles han cambiado. Vuelve a previsualizar la copia.
fr: Les données locales du presse-papiers ont changé. Affichez à nouveau l’aperçu.
ja: このMacのクリップボードデータが変更されました。もう一度プレビューしてください。
ko: 이 Mac의 클립보드 데이터가 변경되었습니다. 백업을 다시 미리 보세요.
pt: Os dados locais da área de transferência mudaram. Visualize o backup novamente.
ru: Локальные данные буфера обмена изменились. Повторите предварительный просмотр.
tr: Yerel pano verileri değişti. Yedeği yeniden önizleyin.
zh_hant: 本機剪貼簿資料已變更。請重新預覽備份。

# backup.error.storage
source: 无法读写备份。请检查可用磁盘空间和文件权限。
ar: تعذرت قراءة النسخة الاحتياطية أو كتابتها. تحقق من مساحة القرص وأذونات الملف.
de: Das Backup kann nicht gelesen oder geschrieben werden. Prüfe Speicherplatz und Dateiberechtigungen.
en: Unable to read or write the backup. Check available disk space and file permissions.
es: No se puede leer o escribir la copia. Comprueba el espacio en disco y los permisos del archivo.
fr: Impossible de lire ou d’écrire la sauvegarde. Vérifiez l’espace disque et les autorisations du fichier.
ja: バックアップを読み書きできません。空き容量とファイルのアクセス権を確認してください。
ko: 백업을 읽거나 쓸 수 없습니다. 여유 디스크 공간과 파일 권한을 확인하세요.
pt: Não foi possível ler ou gravar o backup. Verifique o espaço em disco e as permissões do arquivo.
ru: Не удалось прочитать или записать резервную копию. Проверьте свободное место и права доступа к файлу.
tr: Yedek okunamıyor ya da yazılamıyor. Kullanılabilir disk alanını ve dosya izinlerini denetleyin.
zh_hant: 無法讀寫備份。請檢查可用磁碟空間和檔案權限。

# backup.rollback
source: 恢复本机回滚快照…
ar: استعادة لقطة التراجع المحلية…
de: Lokalen Wiederherstellungspunkt wiederherstellen…
en: Restore Local Rollback Snapshot…
es: Restaurar instantánea local de recuperación…
fr: Restaurer l’instantané local de récupération…
ja: ローカル復元スナップショットを復元…
ko: 로컬 롤백 스냅샷 복원…
pt: Restaurar instantâneo local de recuperação…
ru: Восстановить локальный снимок для отката…
tr: Yerel Geri Alma Anlık Görüntüsünü Geri Yükle…
zh_hant: 還原本機回復快照…

# backup.password
source: 备份密码
ar: كلمة سر النسخة الاحتياطية
de: Backup-Passwort
en: Backup password
es: Contraseña de la copia
fr: Mot de passe de sauvegarde
ja: バックアップパスワード
ko: 백업 암호
pt: Senha do backup
ru: Пароль резервной копии
tr: Yedek parolası
zh_hant: 備份密碼

# backup.confirmPassword
source: 再次输入密码
ar: تأكيد كلمة السر
de: Passwort bestätigen
en: Confirm password
es: Confirmar contraseña
fr: Confirmer le mot de passe
ja: パスワードを確認
ko: 암호 확인
pt: Confirmar senha
ru: Подтвердите пароль
tr: Parolayı doğrula
zh_hant: 再次輸入密碼

# backup.passwordWarning
source: 至少 12 个字符，可使用便于记忆的短语。请妥善保存，MacTools 无法找回密码。
ar: استخدم 12 حرفًا على الأقل. يمكنك استخدام عبارة يسهل تذكرها. احتفظ بها بأمان؛ لا يستطيع MacTools استعادتها.
de: Mindestens 12 Zeichen. Eine einprägsame Passphrase eignet sich gut. Sicher aufbewahren; MacTools kann sie nicht wiederherstellen.
en: Use at least 12 characters. A memorable passphrase works well. Keep it safe; MacTools cannot recover it.
es: Usa al menos 12 caracteres. Una frase fácil de recordar es una buena opción. Guárdala: MacTools no puede recuperarla.
fr: Utilisez au moins 12 caractères, par exemple une phrase facile à retenir. Conservez-la : MacTools ne peut pas la récupérer.
ja: 12 文字以上で、覚えやすいフレーズも使えます。MacTools では復元できないため、大切に保管してください。
ko: 12자 이상으로 입력하세요. 기억하기 쉬운 문구도 좋습니다. MacTools에서 복구할 수 없으니 안전하게 보관하세요.
pt: Use pelo menos 12 caracteres. Uma frase fácil de lembrar é uma boa opção. Guarde-a: o MacTools não pode recuperá-la.
ru: Используйте не менее 12 символов, например запоминающуюся фразу. Сохраните пароль: MacTools не сможет его восстановить.
tr: En az 12 karakter kullanın. Akılda kalıcı bir parola tümcesi işe yarar. Güvenli bir şekilde saklayın; MacTools bunu kurtaramaz.
zh_hant: 至少 12 個字元，可使用便於記憶的短語。請妥善保存，MacTools 無法找回密碼。

# backup.choose
source: 选择备份文件…
ar: اختيار ملف النسخة الاحتياطية…
de: Backupdatei auswählen…
en: Choose Backup File…
es: Elegir archivo de copia de seguridad…
fr: Choisir le fichier de sauvegarde…
ja: バックアップファイルを選択…
ko: 백업 파일 선택…
pt: Escolher arquivo de backup…
ru: Выбрать файл резервной копии…
tr: Yedek Dosyası Seç…
zh_hant: 選擇備份檔案…

# backup.replaceChoice
source: 替换备份中包含的类别（破坏性操作）
ar: استبدال الفئات المضمنة (حذف البيانات)
de: Enthaltene Kategorien ersetzen (destruktiv)
en: Replace included categories (destructive)
es: Reemplazar las categorías incluidas (destructivo)
fr: Remplacer les catégories incluses (destructif)
ja: 含まれるカテゴリを置換（破壊的操作）
ko: 포함된 범주 대체(데이터 삭제)
pt: Substituir categorias incluídas (destrutivo)
ru: Заменить включённые категории (с удалением данных)
tr: Dahil edilen kategorileri değiştir (geri alınamaz)
zh_hant: 取代備份中包含的類別（破壞性操作）

# backup.merge
source: 与本机合并（推荐）
ar: الدمج مع هذا الـ Mac (موصى به)
de: Mit diesem Mac zusammenführen (empfohlen)
en: Merge with This Mac (Recommended)
es: Combinar con este Mac (recomendado)
fr: Fusionner avec ce Mac (recommandé)
ja: このMacと結合（推奨）
ko: 이 Mac과 병합(권장)
pt: Mesclar com este Mac (recomendado)
ru: Объединить с этим Mac (рекомендуется)
tr: Bu Mac ile Birleştir (Önerilen)
zh_hant: 與本機合併（建議）

# backup.manifest
source: 版本 %d · 历史 %d · 已存 %d · 片段 %d
ar: الإصدار %d · السجل %d · المحفوظات %d · المقتطفات %d
de: Version %d · Verlauf %d · Gespeichert %d · Textbausteine %d
en: Version %d · History %d · Saved %d · Snippets %d
es: Versión %d · Historial %d · Guardados %d · Fragmentos %d
fr: Version %d · Historique %d · Enregistrés %d · Extraits %d
ja: バージョン %d · 履歴 %d · 保存済み %d · スニペット %d
ko: 버전 %d · 기록 %d · 저장됨 %d · 스니펫 %d
pt: Versão %d · Histórico %d · Salvos %d · Trechos %d
ru: Версия %d · История %d · Сохранённые %d · Фрагменты %d
tr: Sürüm %d · Geçmiş %d · Kayıtlı %d · Parçacık %d
zh_hant: 版本 %d · 歷史 %d · 已存 %d · 片段 %d

# backup.removed
source: 将移除 %d 个本机项目的所选类别数据。提交前会创建本机加密回滚快照。
ar: ستُحذف بيانات الفئات المحددة من %d من العناصر المحلية. ستُنشأ لقطة محلية مشفرة للتراجع قبل التطبيق.
de: Bei %d lokalen Einträgen werden die Daten der ausgewählten Kategorien entfernt. Vor dem Übernehmen wird ein verschlüsselter lokaler Wiederherstellungspunkt erstellt.
en: %d local items will lose data in the selected categories. An encrypted local rollback snapshot will be created before committing.
es: Se eliminarán los datos de las categorías seleccionadas de %d elementos locales. Se creará una instantánea local cifrada antes de confirmar.
fr: Les données des catégories choisies seront supprimées pour %d éléments locaux. Un instantané local chiffré sera créé avant la validation.
ja: %d 個のローカル項目で選択したカテゴリのデータが削除されます。確定前に暗号化されたローカル復元スナップショットを作成します。
ko: 로컬 항목 %d개의 선택된 범주 데이터가 제거됩니다. 적용 전에 암호화된 로컬 롤백 스냅샷을 만듭니다.
pt: Os dados das categorias selecionadas serão removidos de %d itens locais. Um instantâneo local criptografado será criado antes da confirmação.
ru: Данные выбранных категорий будут удалены у %d локальных элементов. Перед применением будет создан зашифрованный локальный снимок для отката.
tr: Seçili kategorilerdeki %d yerel öğenin verileri kaybolacak. İşlem uygulanmadan önce şifreli bir yerel geri alma anlık görüntüsü oluşturulacak.
zh_hant: 將移除 %d 個本機項目的所選類別資料。提交前會建立本機加密回復快照。

# backup.done
source: 完成
ar: تم
de: Fertig
en: Done
es: Listo
fr: Terminé
ja: 完了
ko: 완료
pt: Concluído
ru: Готово
tr: Tamamlandı

# backup.saved
source: 已存项目
ar: القصاصات المحفوظة
de: Gespeicherte Clips
en: Saved Clips
es: Clips guardados
fr: Clips enregistrés
ja: 保存済みクリップ
ko: 저장된 클립
pt: Clips salvos
ru: Сохранённые записи
tr: Kayıtlı Öğeler
zh_hant: 已存項目

# backup.snippets
source: 片段
ar: المقتطفات
de: Textbausteine
en: Snippets
es: Fragmentos
fr: Extraits
ja: スニペット
ko: 스니펫
pt: Trechos
ru: Фрагменты
tr: Parçacıklar

# backup.history
source: 历史记录
ar: السجل
de: Verlauf
en: History
es: Historial
fr: Historique
ja: 履歴
ko: 기록
pt: Histórico
ru: История
tr: Geçmiş
zh_hant: 歷史記錄

# backup.historyWarning
source: 历史记录可能包含敏感信息。仅在明确需要时加入备份。外部文件仅保存路径。
ar: قد يتضمن السجل معلومات حساسة. أدرجه عند الحاجة فقط. تُحفظ الملفات الخارجية كمراجع للمسارات فقط.
de: Der Verlauf kann sensible Informationen enthalten. Nimm ihn nur bei Bedarf auf. Externe Dateien werden nur als Pfadverweise gespeichert.
en: History may contain sensitive information. Include it only when needed. External files are saved as path references only.
es: El historial puede contener información confidencial. Inclúyelo solo si es necesario. Los archivos externos se guardan solo como referencias de ruta.
fr: L’historique peut contenir des informations sensibles. Ne l’incluez que si nécessaire. Seuls les chemins des fichiers externes sont enregistrés.
ja: 履歴には機密情報が含まれる場合があります。必要な場合のみ含めてください。外部ファイルはパス参照のみ保存されます。
ko: 기록에는 민감한 정보가 포함될 수 있습니다. 필요한 경우에만 포함하세요. 외부 파일은 경로 참조만 저장됩니다.
pt: O histórico pode conter informações confidenciais. Inclua-o apenas quando necessário. Arquivos externos são salvos apenas como referências de caminho.
ru: История может содержать конфиденциальные сведения. Включайте её только при необходимости. Для внешних файлов сохраняются только пути.
tr: Geçmiş hassas bilgiler içerebilir. Yalnızca gerektiğinde dahil edin. Harici dosyalar yalnızca yol referansı olarak kaydedilir.
zh_hant: 歷史記錄可能包含敏感資訊。僅在需要時加入備份。外部檔案僅儲存路徑。

# backup.preview
source: 验证并预览
ar: التحقق والمعاينة
de: Prüfen und Vorschau anzeigen
en: Validate and Preview
es: Validar y previsualizar
fr: Vérifier et afficher l’aperçu
ja: 検証してプレビュー
ko: 검증 및 미리 보기
pt: Validar e visualizar
ru: Проверить и просмотреть
tr: Doğrula ve Önizle
zh_hant: 驗證並預覽

# backup.replaceAll
source: 替换全部剪贴板数据
ar: استبدال جميع بيانات الحافظة
de: Alle Zwischenablagedaten ersetzen
en: Replace All Clipboard Data
es: Reemplazar todos los datos del portapapeles
fr: Remplacer toutes les données du presse-papiers
ja: すべてのクリップボードデータを置換
ko: 모든 클립보드 데이터 대체
pt: Substituir todos os dados da área de transferência
ru: Заменить все данные буфера обмена
tr: Tüm Pano Verilerini Değiştir
zh_hant: 取代全部剪貼簿資料

# backup.replaceScope
source: 替换 %@
ar: استبدال %@
de: %@ ersetzen
en: Replace %@
es: Reemplazar %@
fr: Remplacer %@
ja: %@を置換
ko: %@ 대체
pt: Substituir %@
ru: Заменить %@
tr: %@ Öğesini Değiştir
zh_hant: 取代 %@

# backup.summary
source: 新增 %d · 合并 %d · 冲突保留 %d · 跳过 %d · 停用关键词 %d · 文件路径失效 %d
ar: المضاف %d · المدمج %d · التعارضات المحفوظة %d · المتجاوز %d · الكلمات المعطلة %d · مراجع الملفات المفقودة %d
de: Hinzugefügt %d · Zusammengeführt %d · Konflikte bewahrt %d · Übersprungen %d · Schlüsselwörter deaktiviert %d · Fehlende Dateiverweise %d
en: Added %d · Merged %d · Conflicts preserved %d · Skipped %d · Keywords disabled %d · Missing file references %d
es: Añadidos %d · Combinados %d · Conflictos conservados %d · Omitidos %d · Palabras clave desactivadas %d · Referencias de archivos no encontradas %d
fr: Ajoutés %d · Fusionnés %d · Conflits conservés %d · Ignorés %d · Mots-clés désactivés %d · Références de fichiers manquantes %d
ja: 追加 %d · 結合 %d · 競合を保持 %d · スキップ %d · キーワード無効化 %d · 不明なファイル参照 %d
ko: 추가 %d · 병합 %d · 충돌 보존 %d · 건너뜀 %d · 키워드 비활성화 %d · 누락된 파일 참조 %d
pt: Adicionados %d · Mesclados %d · Conflitos preservados %d · Ignorados %d · Palavras-chave desativadas %d · Referências de arquivos ausentes %d
ru: Добавлено %d · Объединено %d · Конфликтов сохранено %d · Пропущено %d · Ключевых слов отключено %d · Файловых ссылок не найдено %d
tr: Eklenen %d · Birleştirilen %d · Korunan çakışma %d · Atlanan %d · Devre dışı bırakılan anahtar sözcük %d · Eksik dosya referansı %d
zh_hant: 新增 %d · 合併 %d · 衝突保留 %d · 略過 %d · 停用關鍵字 %d · 檔案路徑失效 %d

# backup.reading
source: 正在读取并派生密钥…
ar: جارٍ القراءة واشتقاق المفتاح…
de: Lesen und Schlüssel ableiten…
en: Reading and deriving key…
es: Leyendo y derivando la clave…
fr: Lecture et dérivation de la clé…
ja: 読み込みと鍵の導出中…
ko: 읽기 및 키 파생 중…
pt: Lendo e derivando a chave…
ru: Чтение и получение ключа…
tr: Okunuyor ve anahtar türetiliyor…
zh_hant: 正在讀取並衍生金鑰…

# backup.encrypting
source: 正在加密：%d 项
ar: جارٍ التشفير: %d من العناصر
de: Verschlüsseln: %d Einträge
en: Encrypting: %d items
es: Cifrando: %d elementos
fr: Chiffrement : %d éléments
ja: 暗号化中：%d 項目
ko: 암호화 중: %d개 항목
pt: Criptografando: %d itens
ru: Шифрование: %d элементов
tr: Şifreleniyor: %d öğe
zh_hant: 正在加密：%d 項

# backup.validating
source: 正在验证：%d 项
ar: جارٍ التحقق: %d من العناصر
de: Prüfen: %d Einträge
en: Validating: %d items
es: Validando: %d elementos
fr: Vérification : %d éléments
ja: 検証中：%d 項目
ko: 검증 중: %d개 항목
pt: Validando: %d itens
ru: Проверка: %d элементов
tr: Doğrulanıyor: %d öğe
zh_hant: 正在驗證：%d 項

# backup.staging
source: 正在暂存：%d 项
ar: جارٍ التجهيز: %d من العناصر
de: Vorbereiten: %d Einträge
en: Staging: %d items
es: Preparando: %d elementos
fr: Préparation : %d éléments
ja: 一時保存中：%d 項目
ko: 임시 저장 중: %d개 항목
pt: Preparando: %d itens
ru: Подготовка: %d элементов
tr: Hazırlanıyor: %d öğe
zh_hant: 正在暫存：%d 項

# backup.finishing
source: 正在完成…
ar: جارٍ الإنهاء…
de: Abschließen…
en: Finishing…
es: Finalizando…
fr: Finalisation…
ja: 完了処理中…
ko: 마무리 중…
pt: Finalizando…
ru: Завершение…
tr: Tamamlanıyor…

# backup.busy
source: 请先完成剪贴板备份操作。
ar: أكمل عملية النسخ الاحتياطي للحافظة أولاً.
de: Schließe zuerst den Zwischenablage-Backupvorgang ab.
en: Finish the clipboard backup operation first.
es: Primero termina la operación de copia de seguridad del portapapeles.
fr: Terminez d’abord l’opération de sauvegarde du presse-papiers.
ja: 先にクリップボードのバックアップ操作を完了してください。
ko: 먼저 클립보드 백업 작업을 완료하세요.
pt: Conclua primeiro a operação de backup da área de transferência.
ru: Сначала завершите операцию резервного копирования буфера обмена.
tr: Önce pano yedekleme işlemini tamamlayın.
zh_hant: 請先完成剪貼簿備份操作。

# panel.preview.cachedText
source: 格式预览不可用，显示已保存的文字。
ar: المعاينة المنسقة غير متاحة. يُعرض النص المحفوظ.
de: Formatierte Vorschau nicht verfügbar. Gespeicherter Text wird angezeigt.
en: Formatted preview unavailable. Showing saved text.
es: Vista previa con formato no disponible. Se muestra el texto guardado.
fr: Aperçu formaté indisponible. Affichage du texte enregistré.
ja: 書式付きプレビューを表示できません。保存済みのテキストを表示しています。
ko: 서식 미리보기를 사용할 수 없어 저장된 텍스트를 표시합니다.
pt: Prévia formatada indisponível. Exibindo o texto salvo.
ru: Форматированный предпросмотр недоступен. Показан сохранённый текст.
tr: Biçimli önizleme kullanılamıyor. Kayıtlı metin gösteriliyor.
zh_hant: 格式預覽不可用，顯示已儲存的文字。

# panel.preview.shortened
source: 预览已缩短，原始内容保持完整。
ar: تم اختصار المعاينة. المحتوى الأصلي لم يتغير.
de: Vorschau gekürzt. Der Originalinhalt bleibt unverändert.
en: Preview shortened. Original content is unchanged.
es: Vista previa abreviada. El contenido original no cambia.
fr: Aperçu raccourci. Le contenu original reste inchangé.
ja: プレビューを短縮しています。元の内容は変更されません。
ko: 미리보기가 축약되었습니다. 원본 콘텐츠는 변경되지 않습니다.
pt: Prévia abreviada. O conteúdo original permanece inalterado.
ru: Предпросмотр сокращён. Исходное содержимое не изменено.
tr: Önizleme kısaltıldı. Özgün içerik değişmedi.
zh_hant: 預覽已縮短，原始內容保持完整。

# panel.preview.previous
source: 上一页
ar: السابق
de: Zurück
en: Previous
es: Anterior
fr: Précédent
ja: 前へ
ko: 이전
pt: Anterior
ru: Назад
tr: Önceki
zh_hant: 上一頁

# panel.preview.more
source: 查看更多
ar: عرض المزيد
de: Mehr anzeigen
en: Show more
es: Mostrar más
fr: Afficher plus
ja: さらに表示
ko: 더 보기
pt: Mostrar mais
ru: Показать ещё
tr: Daha fazla göster

# panel.preview.page.format
source: 第 %d 页
ar: الصفحة %d
de: Seite %d
en: Page %d
es: Página %d
fr: Page %d
ja: %d ページ
ko: %d 페이지
pt: Página %d
ru: Страница %d
tr: Sayfa %d
zh_hant: 第 %d 頁

# panel.preview.loading
source: 正在载入预览…
ar: جارٍ تحميل المعاينة…
de: Vorschau wird geladen…
en: Loading preview…
es: Cargando vista previa…
fr: Chargement de l’aperçu…
ja: プレビューを読み込み中…
ko: 미리보기 로딩 중…
pt: Carregando prévia…
ru: Загрузка предпросмотра…
tr: Önizleme yükleniyor…
zh_hant: 正在載入預覽…

# panel.preview.retry
source: 重试
ar: إعادة المحاولة
de: Erneut versuchen
en: Retry
es: Reintentar
fr: Réessayer
ja: 再試行
ko: 다시 시도
pt: Tentar novamente
ru: Повторить
tr: Yeniden Dene
zh_hant: 重試

# panel.preview.failed
source: 无法载入预览
ar: تعذر تحميل المعاينة
de: Vorschau konnte nicht geladen werden
en: Couldn’t load preview
es: No se pudo cargar la vista previa
fr: Impossible de charger l’aperçu
ja: プレビューを読み込めませんでした
ko: 미리보기를 불러올 수 없습니다
pt: Não foi possível carregar a prévia
ru: Не удалось загрузить предпросмотр
tr: Önizleme yüklenemedi
zh_hant: 無法載入預覽

# panel.preview.payloadUnavailable
source: 无法读取已保存的内容。
ar: تعذرت قراءة المحتوى المحفوظ.
de: Der gespeicherte Inhalt konnte nicht gelesen werden.
en: The saved content could not be read.
es: No se pudo leer el contenido guardado.
fr: Le contenu enregistré n’a pas pu être lu.
ja: 保存された内容を読み取れませんでした。
ko: 저장된 내용을 읽을 수 없습니다.
pt: Não foi possível ler o conteúdo salvo.
ru: Не удалось прочитать сохранённое содержимое.
tr: Kayıtlı içerik okunamadı.
zh_hant: 無法讀取已儲存的內容。

# panel.preview.unsupported
source: 此内容没有可用的预览格式。
ar: لا يتوفر تنسيق معاينة مدعوم لهذا المحتوى.
de: Für diesen Inhalt ist kein unterstütztes Vorschauformat verfügbar.
en: This content has no supported preview format.
es: Este contenido no tiene un formato de vista previa compatible.
fr: Ce contenu n’a pas de format d’aperçu pris en charge.
ja: この内容には対応するプレビュー形式がありません。
ko: 이 콘텐츠에는 지원되는 미리보기 형식이 없습니다.
pt: Este conteúdo não tem um formato de prévia compatível.
ru: Для этого содержимого нет поддерживаемого формата предпросмотра.
tr: Bu içeriğin desteklenen bir önizleme biçimi yok.
zh_hant: 此內容沒有可用的預覽格式。

# panel.preview.decodeFailed
source: 无法解码预览，可重试或使用原始内容。
ar: تعذر فك ترميز المعاينة. أعد المحاولة أو استخدم المحتوى الأصلي.
de: Die Vorschau konnte nicht dekodiert werden. Versuchen Sie es erneut oder verwenden Sie den Originalinhalt.
en: The preview could not be decoded. Retry or use the original content.
es: No se pudo decodificar la vista previa. Reinténtalo o usa el contenido original.
fr: L’aperçu n’a pas pu être décodé. Réessayez ou utilisez le contenu original.
ja: プレビューをデコードできませんでした。再試行するか、元の内容を使用してください。
ko: 미리보기를 디코딩할 수 없습니다. 다시 시도하거나 원본 콘텐츠를 사용하세요.
pt: Não foi possível decodificar a prévia. Tente novamente ou use o conteúdo original.
ru: Не удалось декодировать предпросмотр. Повторите попытку или используйте исходное содержимое.
tr: Önizleme çözülemedi. Yeniden deneyin ya da özgün içeriği kullanın.
zh_hant: 無法解碼預覽，可重試或使用原始內容。

# settings.snippets.expandedLimit.title
source: 展开文本上限
ar: حد النص الموسّع
de: Limit für erweiterten Text
en: Expanded Text Limit
es: Límite del texto expandido
fr: Limite du texte développé
ja: 展開後のテキスト上限
ko: 확장된 텍스트 제한
pt: Limite do texto expandido
ru: Лимит развёрнутого текста
tr: Genişletilmiş Metin Sınırı
zh_hant: 展開文字上限

# settings.snippets.expandedLimit.description
source: 限制变量展开后的最终文本，包括预览。超限时会提示错误，不会截断文本。
ar: يحد النص النهائي بعد توسيع المتغيرات، بما في ذلك المعاينات. يُرفض الناتج الذي يتجاوز الحد ولا يُقتطع.
de: Begrenzt den Text nach dem Ersetzen von Variablen, einschließlich Vorschauen. Zu große Ausgaben werden abgelehnt, nie abgeschnitten.
en: Limits the final text after variables expand, including previews. Oversized output is rejected, never truncated.
es: Limita el texto final tras expandir las variables, incluidas las vistas previas. Si supera el límite, se rechaza sin truncarlo.
fr: Limite le texte après le développement des variables, aperçus compris. Un résultat trop long est refusé, jamais tronqué.
ja: プレビューを含む変数展開後のテキストを制限します。上限を超えるとエラーになり、切り詰めは行いません。
ko: 미리보기를 포함해 변수 확장 후 최종 텍스트를 제한합니다. 한도를 넘으면 거부하며 텍스트를 자르지 않습니다.
pt: Limita o texto após expandir as variáveis, incluindo prévias. Resultados acima do limite são rejeitados, nunca truncados.
ru: Ограничивает текст после подстановки переменных, включая предпросмотр. Превышение лимита вызывает ошибку, текст не обрезается.
tr: Değişkenler genişletildikten sonraki son metni sınırlar (önizlemeler dahil). Sınırı aşan çıktı reddedilir, asla kısaltılmaz.
zh_hant: 限制變數展開後的最終文字，包括預覽。超限時會提示錯誤，不會截斷文字。

# saved.error.expandedTextTooLarge
source: 展开文本超过 %lld MB 上限。可在「片段 → 高级」中调整。
ar: يتجاوز النص الموسّع حد %lld م.ب. غيّره في المقتطفات ← متقدم.
de: Der erweiterte Text überschreitet das Limit von %lld MB. Ändere es unter Textbausteine → Erweitert.
en: Expanded text exceeds the %lld MB limit. Change it in Snippets → Advanced.
es: El texto expandido supera el límite de %lld MB. Cámbialo en Fragmentos → Avanzado.
fr: Le texte développé dépasse la limite de %lld Mo. Modifiez-la dans Extraits → Avancé.
ja: 展開後のテキストが %lld MB の上限を超えています。「スニペット → 詳細設定」で変更できます。
ko: 확장된 텍스트가 %lld MB 한도를 초과합니다. 스니펫 → 고급에서 변경하세요.
pt: O texto expandido excede o limite de %lld MB. Altere em Trechos → Avançado.
ru: Развёрнутый текст превышает лимит %lld МБ. Измените его в разделе «Фрагменты → Дополнительно».
tr: Genişletilmiş metin %lld MB sınırını aşıyor. Bunu Parçacıklar → Gelişmiş bölümünden değiştirin.
zh_hant: 展開文字超過 %lld MB 上限。可在「片段 → 進階」中調整。

# saved.error.invalidVariableOptions
source: 请检查变量选项、偏移量和时区。
ar: تحقق من خيارات المتغير والإزاحة والمنطقة الزمنية.
de: Variablenoptionen, Versatz und Zeitzone prüfen.
en: Check the variable options, offset, and time zone.
es: Comprueba las opciones, el desplazamiento y la zona horaria.
fr: Vérifiez les options, le décalage et le fuseau horaire.
ja: 変数のオプション、オフセット、タイムゾーンを確認してください。
ko: 변수 옵션, 오프셋 및 시간대를 확인하세요.
pt: Verifique as opções, o deslocamento e o fuso horário.
ru: Проверьте параметры переменной, смещение и часовой пояс.
tr: Değişken seçeneklerini, farkı ve saat dilimini denetleyin.
zh_hant: 請檢查變數選項、偏移量和時區。

# saved.variable.template
source: 变量模板
ar: قالب المتغير
de: Variablenvorlage
en: Variable Template
es: Plantilla de variable
fr: Modèle de variable
ja: 変数テンプレート
ko: 변수 템플릿
pt: Modelo de variável
ru: Шаблон переменной
tr: Değişken Şablonu
zh_hant: 變數範本

# saved.variable.value
source: 当前值
ar: القيمة الآن
de: Aktueller Wert
en: Value Right Now
es: Valor actual
fr: Valeur actuelle
ja: 現在の値
ko: 현재 값
pt: Valor atual
ru: Текущее значение
tr: Şu Anki Değer
zh_hant: 目前值

# saved.variable.insert
source: 插入
ar: إدراج
de: Einfügen
en: Insert
es: Insertar
fr: Insérer
ja: 挿入
ko: 삽입
pt: Inserir
ru: Вставить
tr: Ekle

# saved.variable.format
source: 格式
ar: التنسيق
de: Format
en: Format
es: Formato
fr: Format
ja: 書式
ko: 형식
pt: Formato
ru: Формат
tr: Biçim

# saved.variable.default
source: 系统默认
ar: افتراضي النظام
de: Systemstandard
en: System Default
es: Predeterminado del sistema
fr: Réglage système
ja: システム標準
ko: 시스템 기본값
pt: Padrão do sistema
ru: Системный формат
tr: Sistem Varsayılanı
zh_hant: 系統預設

# saved.variable.custom
source: 自定义格式…
ar: تنسيق مخصص…
de: Eigenes Format…
en: Custom Format…
es: Formato personalizado…
fr: Format personnalisé…
ja: カスタム書式…
ko: 사용자 지정 형식…
pt: Formato personalizado…
ru: Свой формат…
tr: Özel Biçim…
zh_hant: 自訂格式…

# saved.variable.offset
source: 偏移量
ar: الإزاحة
de: Versatz
en: Offset
es: Desplazamiento
fr: Décalage
ja: オフセット
ko: 오프셋
pt: Deslocamento
ru: Смещение
tr: Fark

# saved.variable.timeZone
source: 时区
ar: المنطقة الزمنية
de: Zeitzone
en: Time Zone
es: Zona horaria
fr: Fuseau horaire
ja: タイムゾーン
ko: 시간대
pt: Fuso horário
ru: Часовой пояс
tr: Saat Dilimi
zh_hant: 時區

# saved.variable.localZone
source: 本地，或 UTC / Asia/Shanghai
ar: محلية أو UTC / Asia/Riyadh
de: Lokal oder UTC / Europe/Berlin
en: Local, or UTC / America/New_York
es: Local o UTC / Europe/Madrid
fr: Local ou UTC / Europe/Paris
ja: ローカル、または UTC / Asia/Tokyo
ko: 현지 또는 UTC / Asia/Seoul
pt: Local ou UTC / Europe/Lisbon
ru: Местный или UTC / Europe/Moscow
tr: Yerel veya UTC / America/New_York
zh_hant: 本地，或 UTC / Asia/Taipei

# saved.variable.trim
source: 去除首尾空白
ar: إزالة الفراغات من الطرفين
de: Äußere Leerzeichen entfernen
en: Trim Surrounding Whitespace
es: Eliminar espacios al principio y al final
fr: Supprimer les espaces aux extrémités
ja: 前後の空白を削除
ko: 앞뒤 공백 제거
pt: Remover espaços nas extremidades
ru: Удалить пробелы по краям
tr: Baştaki ve Sondaki Boşlukları Kaldır
zh_hant: 移除前後空白
